hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_adc.c
#define IS_ADC_EX_CH(x)                                                        \
(   ((x) == ADC_EX_CH_SEL_ANI11)            ||                                 \
    ((x) == ADC_EX_CH_SEL_INTERNAL))


#define IS_AWD_CMP_MODE(x)                                                     \
(   ((x) == ADC_AWD_CMP_OUT_RANGE)          ||                                 \
    ((x) == ADC_AWD_CMP_IN_RANGE))

#define IS_AWD_COMB_MODE(x)                                                    \
(   ((x) == ADC_AWD_COMB_INVALID)           ||                                 \
    ((x) == ADC_AWD_COMB_OR)                ||                                 \
    ((x) == ADC_AWD_COMB_AND)               ||                                 \
    ((x) == ADC_AWD_COMB_XOR))

#define IS_ADC_SA_TRIGGER_EVT(x)                                               \
(   ((x) == EVT_PORT_EIRQ0)                 ||                                 \
    ((x) == EVT_PORT_EIRQ8)                 ||                                 \
    ((x) == EVT_DMA_1_TC0)                  ||                                 \
    ((x) == EVT_DAM_1_BTC0)                 ||                                 \
    ((x) == EVT_PORT_EIRQ1)                 ||                                 \
    ((x) == EVT_PORT_EIRQ9)                 ||                                 \
    ((x) == EVT_DMA_2_TC0)                  ||                                 \
    ((x) == EVT_DAM_2_BTC0)                 ||                                 \
    ((x) == EVT_USART_1_RI)                 ||                                 \
    ((x) == EVT_PORT_EIRQ2)                 ||                                 \
    ((x) == EVT_TMR4_SCMUH)                 ||                                 \
    ((x) == EVT_TMR4_SCMUL)                 ||                                 \
    ((x) == EVT_TMR4_SCMVH)                 ||                                 \
    ((x) == EVT_TMR4_SCMVL)                 ||                                 \
    ((x) == EVT_TMR4_SCMWH)                 ||                                 \
    ((x) == EVT_TMR4_SCMWL)                 ||                                 \
    ((x) == EVT_USART_1_TI)                 ||                                 \
    ((x) == EVT_PORT_EIRQ3)                 ||                                 \
    ((x) == EVT_TMR0_GCMP)                  ||                                 \
    ((x) == EVT_AOS_STRG)                   ||                                 \
    ((x) == EVT_USART_3_RI)                 ||                                 \
    ((x) == EVT_SPI_SPRI)                   ||                                 \
    ((x) == EVT_PORT_EIRQ4)                 ||                                 \
    ((x) == EVT_TMRA_OVF)                   ||                                 \
    ((x) == EVT_TMRA_UDF)                   ||                                 \
    ((x) == EVT_TMRA_CMP)                   ||                                 \
    ((x) == EVT_TMRB_3_OVF)                 ||                                 \
    ((x) == EVT_TMRB_3_UDF)                 ||                                 \
    ((x) == EVT_TMRB_4_CMP)                 ||                                 \
    ((x) == EVT_USART_3_TI)                 ||                                 \
    ((x) == EVT_PORT_EIRQ5)                 ||                                 \
    ((x) == EVT_TMR2_GCMP)                  ||                                 \
    ((x) == EVT_TMRB_4_OVF)                 ||                                 \
    ((x) == EVT_TMRB_4_UDF)                 ||                                 \
    ((x) == EVT_TMRB_3_CMP)                 ||                                 \
    ((x) == EVT_ADC_EOCB)                   ||                                 \
    ((x) == EVT_USART_2_RI)                 ||                                 \
    ((x) == EVT_IIC_RXI)                    ||                                 \
    ((x) == EVT_PORT_EIRQ6)                 ||                                 \
    ((x) == EVT_CMP_1_IRQ)                  ||                                 \
    ((x) == EVT_EVENT_PORT)                 ||                                 \
    ((x) == EVT_TMRB_1_OVF)                 ||                                 \
    ((x) == EVT_TMRB_1_UDF)                 ||                                 \
    ((x) == EVT_TMRB_2_CMP)                 ||                                 \
    ((x) == EVT_USART_2_TI)                 ||                                 \
    ((x) == EVT_IIC_TXI)                    ||                                 \
    ((x) == EVT_PORT_EIRQ7)                 ||                                 \
    ((x) == EVT_CMP_2_IRQ)                  ||                                 \
    ((x) == EVT_FMC_OPTEND)                 ||                                 \
    ((x) == EVT_TMRB_2_OVF)                 ||                                 \
    ((x) == EVT_TMRB_2_UDF)                 ||                                 \
    ((x) == EVT_TMRB_1_CMP)                 ||                                 \
    ((x) == EVT_SPI_SPTI))

#define IS_ADC_SB_TRIGGER_EVT(x)                                               \
(   ((x) == EVT_PORT_EIRQ0)                 ||                                 \
    ((x) == EVT_PORT_EIRQ8)                 ||                                 \
    ((x) == EVT_DMA_1_TC0)                  ||                                 \
    ((x) == EVT_DAM_1_BTC0)                 ||                                 \
    ((x) == EVT_PORT_EIRQ1)                 ||                                 \
    ((x) == EVT_PORT_EIRQ9)                 ||                                 \
    ((x) == EVT_DMA_2_TC0)                  ||                                 \
    ((x) == EVT_DAM_2_BTC0)                 ||                                 \
    ((x) == EVT_USART_1_RI)                 ||                                 \
    ((x) == EVT_PORT_EIRQ2)                 ||                                 \
    ((x) == EVT_TMR4_SCMUH)                 ||                                 \
    ((x) == EVT_TMR4_SCMUL)                 ||                                 \
    ((x) == EVT_TMR4_SCMVH)                 ||                                 \
    ((x) == EVT_TMR4_SCMVL)                 ||                                 \
    ((x) == EVT_TMR4_SCMWH)                 ||                                 \
    ((x) == EVT_TMR4_SCMWL)                 ||                                 \
    ((x) == EVT_USART_1_TI)                 ||                                 \
    ((x) == EVT_PORT_EIRQ3)                 ||                                 \
    ((x) == EVT_TMR0_GCMP)                  ||                                 \
    ((x) == EVT_AOS_STRG)                   ||                                 \
    ((x) == EVT_USART_3_RI)                 ||                                 \
    ((x) == EVT_SPI_SPRI)                   ||                                 \
    ((x) == EVT_PORT_EIRQ4)                 ||                                 \
    ((x) == EVT_TMRA_OVF)                   ||                                 \
    ((x) == EVT_TMRA_UDF)                   ||                                 \
    ((x) == EVT_TMRA_CMP)                   ||                                 \
    ((x) == EVT_TMRB_3_OVF)                 ||                                 \
    ((x) == EVT_TMRB_3_UDF)                 ||                                 \
    ((x) == EVT_TMRB_4_CMP)                 ||                                 \
    ((x) == EVT_ADC_EOCA)                   ||                                 \
    ((x) == EVT_USART_3_TI)                 ||                                 \
    ((x) == EVT_PORT_EIRQ5)                 ||                                 \
    ((x) == EVT_TMR2_GCMP)                  ||                                 \
    ((x) == EVT_TMRB_4_OVF)                 ||                                 \
    ((x) == EVT_TMRB_4_UDF)                 ||                                 \
    ((x) == EVT_TMRB_3_CMP)                 ||                                 \
    ((x) == EVT_USART_2_RI)                 ||                                 \
    ((x) == EVT_IIC_RXI)                    ||                                 \
    ((x) == EVT_PORT_EIRQ6)                 ||                                 \
    ((x) == EVT_CMP_1_IRQ)                  ||                                 \
    ((x) == EVT_EVENT_PORT)                 ||                                 \
    ((x) == EVT_TMRB_1_OVF)                 ||                                 \
    ((x) == EVT_TMRB_1_UDF)                 ||                                 \
    ((x) == EVT_TMRB_2_CMP)                 ||                                 \
    ((x) == EVT_USART_2_TI)                 ||                                 \
    ((x) == EVT_IIC_TXI)                    ||                                 \
    ((x) == EVT_PORT_EIRQ7)                 ||                                 \
    ((x) == EVT_CMP_2_IRQ)                  ||                                 \
    ((x) == EVT_FMC_OPTEND)                 ||                                 \
    ((x) == EVT_TMRB_2_OVF)                 ||                                 \
    ((x) == EVT_TMRB_2_UDF)                 ||                                 \
    ((x) == EVT_TMRB_1_CMP)                 ||                                 \
    ((x) == EVT_SPI_SPTI))

#define IS_AWD_PIN_NUMBER(x)                                                   \
(   ((x) == ADC_ANI0)                       ||                                 \
    (((x) >= ADC_ANI1) && ((x) <= ADC_ANI11)))

/**
 * @}
 */

/**
 * @}
 */

