hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_adc.c
        /* Disable the specified sequence's trigger source. */
        ADC_TriggerSrcCmd(u8Seq, Disable);

        if (u8Seq == ADC_SEQ_A)
        {
            u8Offset = 0u;
            DDL_ASSERT(IS_ADC_SA_TRIGGER_EVT(pstcTrgCfg->u32Event0));
            DDL_ASSERT(IS_ADC_SA_TRIGGER_EVT(pstcTrgCfg->u32Event1));
        }
        else
        {
            u8Offset = 8u;
            DDL_ASSERT(IS_ADC_SB_TRIGGER_EVT(pstcTrgCfg->u32Event0));
            DDL_ASSERT(IS_ADC_SB_TRIGGER_EVT(pstcTrgCfg->u32Event1));
        }

        switch (pstcTrgCfg->u16TrgSrc)
        {
            case ADC_TRGSRC_IN_EVT0:
                ADC_TRG_EVT0_REG = pstcTrgCfg->u32Event0;
                break;

            case ADC_TRGSRC_IN_EVT1:
                ADC_TRG_EVT1_REG = pstcTrgCfg->u32Event1;
                break;

            case ADC_TRGSRC_IN_EVT0_EVT1:
                ADC_TRG_EVT0_REG = pstcTrgCfg->u32Event0;
                ADC_TRG_EVT1_REG = pstcTrgCfg->u32Event1;
                break;

            default:
                break;
        }

        M0P_ADC->TRGSR &= (uint16_t)(~(ADC_TRGSRC_MASK << u8Offset));
        M0P_ADC->TRGSR |= (uint16_t)(pstcTrgCfg->u16TrgSrc << u8Offset);

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set a default value for the trigger source configuration structure.
 * @param  [in]  pstcTrgCfg         Pointer to a stc_adc_trg_cfg_t structure that
 *                                  contains configuration information.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pstcTrgCfg == NULL.
 */
en_result_t ADC_TriggerSrcStructInit(stc_adc_trg_cfg_t *pstcTrgCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcTrgCfg != NULL)
    {
        pstcTrgCfg->u16TrgSrc = ADC_TRGSRC_IN_EVT0;
        pstcTrgCfg->u32Event0 = EVT_AOS_STRG;
        pstcTrgCfg->u32Event1 = EVT_AOS_STRG;

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Enable or disable the trigger source of the specified sequence.
 * @param  [in]  u8Seq              The sequence to be configured.
 *                                  This parameter can be a value of @ref ADC_Sequence
 *   @arg  ADC_SEQ_A
 *   @arg  ADC_SEQ_B
 * @param  [in]  enNewState         An en_functional_state_t enumeration value.
 *   @arg  Enable:                  Enable the trigger source of the specified sequence.
 *   @arg  Disable:                 Disable the trigger source of the specified sequence.
 * @retval None
 * @note   ADC must be stoped.
 */
void ADC_TriggerSrcCmd(uint8_t u8Seq, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_ADC_SEQUENCE(u8Seq));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (u8Seq == ADC_SEQ_A)
    {
        bM0P_ADC->TRGSR_b.TRGENA = (uint32_t)enNewState;
    }
    else
    {
        bM0P_ADC->TRGSR_b.TRGENB = (uint32_t)enNewState;
    }
}

/**
 * @brief  Enable or disable the interrupt of the specified sequence.
 * @param  [in]  u8Seq              The sequence to be configured.
 *                                  This parameter can be a value of @ref ADC_Sequence
 *   @arg  ADC_SEQ_A
 *   @arg  ADC_SEQ_B
 * @param  [in]  enNewState         An en_functional_state_t enumeration value.
 *   @arg  Enable:                  Enable the interrupt of the specified sequence.
 *   @arg  Disable:                 Disable the interrupt of the specified sequence.
 * @retval None
 * @note   ADC must be stoped.
 */
void ADC_AdcIntCmd(uint8_t u8Seq, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_ADC_SEQUENCE(u8Seq));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (u8Seq == ADC_SEQ_A)
    {
        bM0P_ADC->ICR_b.EOCAIEN = (uint32_t)enNewState;
    }
    else
    {
        bM0P_ADC->ICR_b.EOCBIEN = (uint32_t)enNewState;
    }
}

/**
 * @brief  Gets the EOC(End Of Conversion) flag.
 * @param  [in]  u8Flag         ADC EOC flag.
 *                              This parameter can be a value of @ref ADC_Eoc_Flag
 *   @arg  ADC_FLAG_EOCA
 *   @arg  ADC_FLAG_EOCB
 * @retval An en_flag_status_t enumeration.
 *   @arg  Set: The specified flag has set.
 *   @arg  Reset: The specified flag has not set.
 */
en_flag_status_t ADC_GetEocFlag(uint8_t u8Flag)
{
    en_flag_status_t enFlag = Reset;

    if ((M0P_ADC->ISR & u8Flag) != 0u)
    {
        enFlag = Set;
    }

    return enFlag;
}

/**
 * @brief  Clear the EOC(End Of Conversion) flag.
 * @param  [in]  u8Flag             An 8bit data that containing EOCA(End Of Conversion of Sequence A)
 *                                  flag and EOCB flag. This parameter can be values of @ref ADC_Eoc_Flag
 *   @arg  ADC_FLAG_EOCA
 *   @arg  ADC_FLAG_EOCB
 * @retval None
 */
void ADC_ClrEocFlag(uint8_t u8Flag)
{
    u8Flag &= ADC_FLAG_EOC_ALL;
    M0P_ADC->ISCLRR |= u8Flag;
}

/**
 * @brief  Starts ADC conversion of sequence A.
 * @param  [out] pu16Dest           Pointer to the buffer the ADC data to be stored.
 * @param  [in]  u8Length           The length of the array pointed by pu16Dest.
 * @param  [in]  u32Timeout         Timeout value(millisecond).
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pu16Dest == NULL or u32Timeout == 0.
 *   @arg  ErrorTimeout:            ADC works timeout.
 */
en_result_t ADC_PollingSa(uint16_t *pu16Dest, uint8_t u8Length, uint32_t u32Timeout)
{
    en_result_t   enRet = ErrorInvalidParameter;
    uint16_t      u16Channel;
    uint32_t      u32AdcTimeout;
    __IO uint32_t u32TimeCount;

    if ((pu16Dest != NULL) && (u8Length != 0u) && (u32Timeout != 0u))
    {
        /* 10 is the number of required instructions cycles for the below loop statement. */
        u32AdcTimeout = u32Timeout * (SystemCoreClock / 10u / 1000u);

        ADC_Start();

        /* Polling and check timeout. */
        u32TimeCount = 0u;
        enRet = ErrorTimeout;
        while (u32TimeCount < u32AdcTimeout)
        {
            if (bM0P_ADC->ISR_b.EOCAF != 0u)
            {
                if (u8Length >= ADC_CH_COUNT)
                {
                    ADC_GetAllData(pu16Dest, ADC_CH_COUNT);
                }
                else
                {
                    u16Channel = M0P_ADC->CHSELRA0;
                    ADC_GetChannelData(u16Channel, pu16Dest, u8Length);
                }
                enRet = Ok;
                break;
            }
            u32TimeCount++;
        }

        bM0P_ADC->ISCLRR_b.CLREOCAF = 1u;
    }

    return enRet;
}

/**
 * @brief  Get all of the ADC data.
 * @param  [out] pu16Dest           Pointer to the buffer the ADC data to be stored.
 * @param  [in]  u8Length           The length of the array pointed by the pointer pu16Dest.
 *                                  It must be no less than @ref ADC_Channel_Count
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pu16Dest == NULL or u8Length < ADC_CH_COUNT.
 */
en_result_t ADC_GetAllData(uint16_t *pu16Dest, uint8_t u8Length)
{
    uint8_t  i;
    en_result_t enRet = ErrorInvalidParameter;
    __IO uint16_t *io16AdcDr = &M0P_ADC->DR0;

    if ((pu16Dest != NULL) && (u8Length >= ADC_CH_COUNT))
    {
        for (i = 0u; i < ADC_CH_COUNT; i++)
        {
            pu16Dest[i] = io16AdcDr[i];
        }

