hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_adc.c
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get the ADC data of the specified channel(s).
 * @param  [in]  u16Channel         The specified Channel(s).
 *                                  This parameter can be values of @ref ADC_Channels
 *   @arg  ADC_CH0 ~ ADC_CH11
 * @param  [out] pu16Dest           Pointer to the buffer the ADC data to be stored.
 * @param  [in]  u8Length           The length of the array pointed by pu16Dest.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   u16Channel == 0 or pu16Dest == NULL or u8Length == 0
 */
en_result_t ADC_GetChannelData(uint16_t u16Channel, uint16_t *pu16Dest, uint8_t u8Length)
{
    uint8_t i;
    uint8_t j;
    en_result_t enRet = ErrorInvalidParameter;
    __IO uint16_t *io16AdcDr = NULL;

    if ((u16Channel != 0u) && (pu16Dest != NULL) && (u8Length != 0u))
    {
        i = 0u;
        j = 0u;
        io16AdcDr = &M0P_ADC->DR0;
        u16Channel &= ADC_CH_ALL;
        while (u16Channel && u8Length)
        {
            if (u16Channel & 0x1u)
            {
                pu16Dest[j++] = io16AdcDr[i];
                u8Length--;
            }

            u16Channel >>= 1u;
            i++;
        }

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get the ADC value of the specified ADC pin.
 * @param  [in]  u8AdcPin           The ADC pin number.
 *                                  This parameter can be a value of @ref ADC_Pin_Number
 * @retval An uint16_t value -- the ADC value of the specified ADC pin.
 */
uint16_t ADC_GetValue(uint8_t u8AdcPin)
{
    uint16_t u16Ret = (uint16_t)0xFFFF;
    __IO uint16_t *io16AdcDr = &M0P_ADC->DR0;

    if (u8AdcPin <= ADC_ANI11)
    {
        u16Ret = io16AdcDr[u8AdcPin];
    }

    return u16Ret;
}

/**
 * @brief  Configures an AWD's comparison mode.
 * @param  [in]  u8AwdNbr           The specified AWD to be configured.
 *                                  This parameter can be a value of @ref ADC_AWD_Number
 *   @arg  ADC_AWD_0
 *   @arg  ADC_AWD_1
 * @param  [in]  pstcAwdCfg         Pointer to a stc_awd_cfg_t structure that contains
 *                                  the configuration information for the AWD.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                      No errors occurred.
 *   @arg  ErrorInvalidParameter:   pstcAwdCfg == NULL.
 * @note   ADC must be stoped.
 */
en_result_t ADC_AwdConfig(uint8_t u8AwdNbr, const stc_awd_cfg_t *pstcAwdCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcAwdCfg != NULL)
    {
        DDL_ASSERT(IS_AWD_NUMBER(u8AwdNbr));
        DDL_ASSERT(IS_AWD_PIN_NUMBER(pstcAwdCfg->u8AdcPin));
        DDL_ASSERT(IS_AWD_CMP_MODE(pstcAwdCfg->u16AwdMd));

        /* Disable AWDx. */
        ADC_AwdCmd(u8AwdNbr, Disable);

        /* Disable combination mode. */
        M0P_ADC->AWDCR &= (uint16_t)(~ADC_AWD_COMB_MASK);

        if (u8AwdNbr == ADC_AWD_0)
        {
            bM0P_ADC->AWDCR_b.AWD0MD = (uint32_t)pstcAwdCfg->u16AwdMd;
            M0P_ADC->AWD0DR0  = pstcAwdCfg->u16Dr0;
            M0P_ADC->AWD0DR1  = pstcAwdCfg->u16Dr1;
            M0P_ADC->AWD0CHSR = pstcAwdCfg->u8AdcPin;
        }
        else
        {
            bM0P_ADC->AWDCR_b.AWD1MD = (uint32_t)pstcAwdCfg->u16AwdMd;
            M0P_ADC->AWD1DR0  = pstcAwdCfg->u16Dr0;
            M0P_ADC->AWD1DR1  = pstcAwdCfg->u16Dr1;
            M0P_ADC->AWD1CHSR = pstcAwdCfg->u8AdcPin;
        }

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Enable or Disable an AWD.
 * @param  [in]  u8AwdNbr           The specified AWD to be configured.
 *                                  This parameter can be a value of @ref ADC_AWD_Number
 *   @arg  ADC_AWD_0
 *   @arg  ADC_AWD_1
 * @param  [in]  enNewState         An en_functional_state_t enumeration value.
 *   @arg  Enable:                  Enable the specified AWD.
 *   @arg  Disable:                 Disable the specified AWD.
 * @retval None
 * @note   ADC must be stoped.
 */
void ADC_AwdCmd(uint8_t u8AwdNbr, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_AWD_NUMBER(u8AwdNbr));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (u8AwdNbr == ADC_AWD_0)
    {
        bM0P_ADC->AWDCR_b.AWD0EN = (uint32_t)enNewState;
    }
    else
    {
        bM0P_ADC->AWDCR_b.AWD1EN = (uint32_t)enNewState;
    }
}

/**
 * @brief  Enable or Disable an AWD's interrupt.
 * @param  [in]  u8AwdNbr           The specified AWD to be configured.
 *                                  This parameter can be a value of @ref ADC_AWD_Number
 *   @arg  ADC_AWD_0
 *   @arg  ADC_AWD_1
 * @param  [in]  enNewState         An en_functional_state_t enumeration value.
 *   @arg  Enable:                  Enable the interrupt of the specified AWD.
 *   @arg  Disable:                 Disable the interrupt of the specified AWD.
 * @retval None
 * @note   ADC must be stoped.
 */
void ADC_AwdIntCmd(uint8_t u8AwdNbr, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_AWD_NUMBER(u8AwdNbr));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (u8AwdNbr == ADC_AWD_0)
    {
        bM0P_ADC->AWDCR_b.AWD0IEN = (uint32_t)enNewState;
    }
    else
    {
        bM0P_ADC->AWDCR_b.AWD1IEN = (uint32_t)enNewState;
    }
}

/**
 * @brief  Configures the combined mode of the AWD.
 * @param  [in]  u16ComMd           This parameter can be a value of @ref ADC_AWD_Combination_Mode
 *   @arg  ADC_AWD_COMB_INVALID:    Analog watchdog combination mode is invalid.
 *   @arg  ADC_AWD_COMB_OR:         AWD result of combination will be AWD0 | AWD1.
 *   @arg  ADC_AWD_COMB_AND:        AWD result of combination will be AWD0 & AWD1.
 *   @arg  ADC_AWD_COMB_XOR:        AWD result of combination will be AWD0 ^ AWD1.
 * @retval None
 * @note   ADC must be stoped.
 */
void ADC_AwdConfigCombMode(uint16_t u16ComMd)
{
    DDL_ASSERT(IS_AWD_COMB_MODE(u16ComMd));

    M0P_ADC->AWDCR &= (uint16_t)(~ADC_AWD_COMB_MASK);
    M0P_ADC->AWDCR |= u16ComMd;
}

/**
 * @brief  Gets the AWD state flag.
 * @param  [in]  u8Flag         AWD state flag.
 *                              This parameter can be a value of @ref ADC_AWD_State_Flag
 *   @arg  ADC_FLAG_AWD0
 *   @arg  ADC_FLAG_AWD1
 *   @arg  ADC_FLAG_AWD_COMB
 * @retval An en_flag_status_t enumeration.
 *   @arg  Set: The specified flag has set.
 *   @arg  Reset: The specified flag has not set.
 */
en_flag_status_t ADC_AwdGetFlag(uint8_t u8Flag)
{
    en_flag_status_t enFlag = Reset;

