hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_adc.c
    if ((M0P_ADC->AWDSR & u8Flag) != 0u)
    {
        enFlag = Set;
    }

    return enFlag;
}

/**
 * @brief  ADC clear AWD state flag.
 * @param  [in]  u8Flag             An 8bit data that containing AWD0, AWD1 and combination flag.
 *                                  This parameter can be values of @ref ADC_AWD_State_Flag
 *   @arg  ADC_FLAG_AWD0
 *   @arg  ADC_FLAG_AWD1
 *   @arg  ADC_FLAG_AWD_COMB
 *   @arg  ADC_FLAG_AWD_ALL
 * @retval None
 */
void ADC_AwdClrFlag(uint8_t u8Flag)
{
    u8Flag &= ADC_FLAG_AWD_ALL;
    M0P_ADC->AWDSCLRR |= u8Flag;
}

/**
 * @brief  Enale or disable specify OPA.
 * @param  [in]  u8OpaNbr           The number of the specify OPA.
 *                                  This parameter can be a value of @ref ADC_OPA_Number
 *   @arg  ADC_OPA_1
 *   @arg  ADC_OPA_2
 * @param  [in]  enNewState         An en_functional_state_t enumeration value.
 *   @arg  Enable:                  Enable the specify OPA.
 *   @arg  Disable:                 Disable the specify OPA.
 * @retval None
 */
void ADC_OpaCmd(uint8_t u8OpaNbr, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_OPA_NUMBER(u8OpaNbr));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (u8OpaNbr == ADC_OPA_1)
    {
        bM0P_ADC->OPACR_b.OPA1EN = (uint32_t)enNewState;
    }
    else
    {
        bM0P_ADC->OPACR_b.OPA2EN = (uint32_t)enNewState;
    }
}

/**
 * @}
 */

#endif /* DDL_ADC_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
